<template>
  <div  class="container mx-auto my-20">
    <div class="max-w-3xl mx-auto px-4">
      <div class="text-center mb-5">
        <h1 class="text-3xl font-bold mb-2">Приветствую, меня зовут Тимур Есентаев</h1>
      <p class="text-xl">Это мое тестовое отборочное задание на Frontend разработчика</p>
      </div>

    <div>
      <h4 class="text-xl font-bold mb-2">Описание задачи:</h4>
      <p class="text-base">Разработать простое приложение таск-менеджера с использованием Vue 3, включая работу с vuex или pinia и vue-router.</p>
      <ul class="list-disc pl-6 mb-9">
      <li>Приложение должно иметь главную страницу и страницу со списком задач. (на главной странице переход на страницу со списком задач, по желанию можете дать волю своей фантазии)</li>
      <li>На странице со списком задач должна быть форма создания задачи..</li>
      <li>Задачи можно удалить и отредактировать.</li>
      <li>При обновлении страницы должны отображаться сохранённые задачи.</li>
    </ul>

    <h4 class="text-xl font-bold mb-2">Выполнено</h4>
    <p class="text-base">При разработке использовался: Vue 3, Pinia, Router, TailwindCss</p>
    <ul class="list-disc pl-6 mb-4">
      <li>Приложение имеет главную страницу, и <RouterLink class="text-blue-500 hover:underline" to="/tasks">страницу со списком задач</RouterLink></li>
      <li>На странице Список задач имеется форма создания задач (скрыта, открывается при клике на Создать задачу)</li>
      <li>Задачи можно редактировать и удалять, редактируется в той же форме, что и для создания задачи - компонент переиспользуется</li>
      <li>При обновлении страницы сохраненные задачи отображаются - используется localStorage</li>
    </ul>
    </div>
    </div>
    
  </div>
</template>

